.emacs.d/init.org
# -*- mode: org -*-
#+TITLE: Emacs init.el File using Orgmode
#+AUTHOR: Pedro Bruel
#+EMAIL: pedro.bruel@gmail.com
#+EXPORT_EXCLUDE_TAGS: noexport
#+STARTUP: fold indent logdrawer
#+LANGUAGE: en

* Packages
** Archives
- Getting latest MELPA packages, but not using stable versions since
  many packages won't appear.
- Getting latest org version:

#+begin_SRC emacs-lisp :tangle init.el
(require 'package)

(setq package-archives '(("org" . "https://orgmode.org/elpa/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("gnu" . "https://elpa.gnu.org/packages/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))
#+end_SRC

** Git Packages
*** Creating lisp directory
#+begin_SRC emacs-lisp :tangle init.el
(unless (file-directory-p "~/.emacs.d/lisp/")
  (make-directory "~/.emacs.d/lisp"))
#+end_SRC

*** org-mode from git
This clones org-mode =release_9.4.5= and loads it locally.

#+begin_SRC emacs-lisp :tangle init.el
(unless (file-directory-p "~/.emacs.d/lisp/org-mode")
    (shell-command (concat "cd ~/.emacs.d/lisp && "
                           "git clone "
                           "--branch release_9.4.5 "
                           "https://code.orgmode.org/bzg/org-mode.git && "
                           "cd org-mode && make all")))

(let ((default-directory  "~/.emacs.d/lisp/"))
  (setq load-path
        (append
         (let ((load-path (copy-sequence load-path)))
           (normal-top-level-add-to-load-path '("org-mode/lisp"
                                                "org-mode/contrib/lisp")))
         load-path)))

#+end_SRC
*** ob-julia from git
Getting ob-julia:
#+begin_SRC emacs-lisp :tangle init.el
(unless (file-directory-p "~/.emacs.d/lisp/ob-julia")
    (shell-command (concat "cd ~/.emacs.d/lisp && "
                           "git clone "
                           "--branch v0.0.1 "
                           "https://github.com/phrb/ob-julia.git && "
                           "cd ob-julia && make all")))

(if (file-directory-p "~/.emacs.d/lisp/ob-julia")
    (let ((default-directory  "~/.emacs.d/lisp/"))
      (setq load-path
            (append
             (let ((load-path (copy-sequence load-path)))
               (normal-top-level-add-to-load-path '("ob-julia")))
             load-path))))
#+end_SRC

*** org-bullets
Getting org-bullets:
#+begin_SRC emacs-lisp :tangle init.el
(if (file-directory-p "~/.emacs.d/lisp/org-bullets")
    (let ((default-directory  "~/.emacs.d/lisp/"))
      (setq load-path
            (append
             (let ((load-path (copy-sequence load-path)))
               (normal-top-level-add-to-load-path '("org-bullets")))
             load-path))))
#+end_SRC
*** Local org2jekyll
Getting org2jekyll:
#+begin_SRC emacs-lisp :tangle init.el
(if (file-directory-p "~/.emacs.d/lisp/org2jekyll")
    (let ((default-directory  "~/.emacs.d/lisp/"))
      (setq load-path
            (append
             (let ((load-path (copy-sequence load-path)))
               (normal-top-level-add-to-load-path '("org2jekyll")))
             load-path))))
#+end_SRC
*** Local ob-jl
This is an attempt to rewrite ob-julia from scratch.
#+begin_SRC emacs-lisp :tangle no
(if (file-directory-p "~/.emacs.d/lisp/ob-jl")
    (let ((default-directory  "~/.emacs.d/lisp/"))
      (setq load-path
            (append
             (let ((load-path (copy-sequence load-path)))
               (normal-top-level-add-to-load-path '("ob-jl")))
             load-path))))
#+end_SRC
*** Refresh Packages
#+begin_SRC emacs-lisp :tangle init.el
(unless package-archive-contents
  (package-refresh-contents))
#+end_SRC
** Ensure Installed
#+begin_SRC emacs-lisp :tangle init.el
(setq pkg-deps '(graphviz-dot-mode
                 ebib
                 magit
                 cuda-mode
                 doom-modeline
                 doom-themes
                 all-the-icons
                 rust-mode
                 dockerfile-mode
                 lua-mode
                 ace-window
                 jupyter
                 yaml-mode
                 markdown-mode
                 aggressive-indent
                 counsel
                 ess
                 swiper
                 kv
                 which-key
                 s
                 powerline
                 julia-mode
                 ivy
                 evil
                 deferred
                 dash-functional
                 base16-theme))

(dolist (pkg pkg-deps)
  (unless (package-installed-p pkg)
    (package-install pkg)))
#+end_SRC
* Function
** Saving Session & History
Enables saving command history and Emacs buffer list:

#+begin_SRC emacs-lisp :tangle init.el
(savehist-mode 1)
(desktop-save-mode 1)

(setq-default desktop-save t)
(setq-default desktop-auto-save-timeout 10)
#+end_SRC

** Encoding
#+begin_SRC emacs-lisp :tangle init.el
(setq-default buffer-file-coding-system 'utf-8-unix)
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8-unix)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(autoload 'ansi-color-for-comint-mode-on "ansi-color" nil t)
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
#+end_SRC

** Tabs as Spaces
#+begin_SRC emacs-lisp :tangle init.el
(setq-default indent-tabs-mode nil)
#+end_SRC

** File Position
Rememeber position in files, except unreadable ones:
#+begin_SRC emacs-lisp :tangle init.el
(save-place-mode 1)
(setq save-place-forget-unreadable-files nil)
#+end_SRC
** Update Changed Files
Emacs gets notified by changed files and updates buffers automatically:
#+begin_SRC emacs-lisp :tangle init.el
(global-auto-revert-mode t)
#+end_SRC
** Backups
Create backup and autosave directories if none exist:

#+begin_SRC emacs-lisp :tangle init.el
(defvar backup-directory (concat user-emacs-directory "backups/"))
(defvar autosave-directory (concat user-emacs-directory "autosave/"))

(if (not (file-exists-p backup-directory)) (make-directory backup-directory t))
(if (not (file-exists-p autosave-directory)) (make-directory autosave-directory t))

(setq backup-directory-alist `((".*" . ,backup-directory)))
(setq auto-save-file-name-transforms `((".*" ,autosave-directory t)))
#+end_SRC

Configure backups and autosave:

#+begin_SRC emacs-lisp :tangle init.el
(setq make-backup-files t)
(setq auto-save-default t)
(setq auto-save-timeout 45)
#+end_SRC

Do not create lockfiles:

#+begin_SRC emacs-lisp :tangle init.el
(setq create-lockfiles nil)
#+end_SRC

Auto save based on keystrokes:

#+begin_SRC emacs-lisp :tangle init.el
(setq auto-save-interval 300)
#+end_SRC
** Custom Configuration File
Options chosen with the customize UI live here:

#+begin_src emacs-lisp :tangle init.el
(setq custom-file "~/.emacs.d/emacs-custom.el")
(load custom-file)
#+end_src
** Default Programs
#+begin_SRC emacs-lisp :tangle init.el
(setq browse-url-browser-function 'browse-url-generic)
(setq browse-url-generic-program "firefox")
#+end_SRC
** Paragraph Fill
#+begin_SRC emacs-lisp :tangle init.el
(setq-default fill-column 80)
#+end_SRC
** Hide/Show
Turns  on  hide/show minor  mode  for  all  programming modes.   Check  commands
[[https://www.emacswiki.org/emacs/HideShow][here]].
#+begin_SRC emacs-lisp :tangle init.el
(add-hook 'prog-mode-hook #'hs-minor-mode)
#+End_SRC
** Yes-or-no
#+begin_SRC emacs-lisp :tangle init.el
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_SRC
** CUDA Mode
#+begin_SRC emacs-lisp :tangle init.el
(add-to-list 'auto-mode-alist '("\.cu$" . c++-mode))
#+end_SRC
* Aesthetics
** Screen
*** Splashscreen
#+begin_SRC emacs-lisp :tangle init.el
(setq inhibit-splash-screen t)
#+end_SRC
** Window Splits
Prefer splitting vertically:
#+begin_SRC emacs-lisp :tangle no
(setq split-height-threshold 20)
(setq split-width-threshold 60)
#+end_SRC
** Color Theme
To use =base16= themes, install the =base16-theme= package and run:
#+begin_SRC emacs-lisp :tangle init.el
(require 'base16-theme)
(load-theme 'base16-default-dark t)
#+end_SRC
** Toolbar, Menubar, Scrollbar & Fringe
#+begin_SRC emacs-lisp :tangle init.el
(menu-bar-mode -1)
(toggle-scroll-bar -1)
(tool-bar-mode -1)
(set-fringe-mode 0)
#+end_SRC
** Font
#+begin_SRC emacs-lisp :tangle init.el
(add-to-list 'default-frame-alist '(font . "Liberation Mono-13" ))
(set-face-attribute 'default t :font "Liberation Mono-13" )
#+end_SRC
** Cursor
For more configuration, such as color states, check Section [[Evil]].

Stop blinking:
#+begin_SRC emacs-lisp :tangle init.el
(blink-cursor-mode 0)
#+end_SRC
** Scrolling
Scroll one line at a time:
#+begin_SRC emacs-lisp :tangle init.el
(setq scroll-step 1)
(setq scroll-conservatively  10000)
(setq auto-window-vscroll nil)
#+end_SRC
** Whitespace
Remove trailing whitespace before saving:
#+begin_SRC emacs-lisp :tangle init.el
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_SRC
** Parenthesis
#+begin_SRC emacs-lisp :tangle init.el
(show-paren-mode 1)
#+end_SRC
** Indentation
Set C/C++ indentation levels:
#+begin_SRC emacs-lisp :tangle init.el
(setq-default c-default-style "linux"
              c-basic-offset 4)
#+end_SRC
** Line Numbering
Enable line numbering for all programming modes:
#+begin_SRC emacs-lisp :tangle init.el
(add-hook 'prog-mode-hook 'linum-mode)
#+end_SRC
** Powerline
Enable powerline:
#+begin_SRC emacs-lisp :tangle no
(require 'powerline)
(powerline-center-evil-theme)
#+end_SRC
** Doom Modeline
#+begin_SRC emacs-lisp :tangle init.el
(require 'doom-modeline)
(doom-modeline-mode 1)
(setq doom-modeline-height 1)
(set-face-attribute 'mode-line nil :family "Liberation Mono" :height 110)
(set-face-attribute 'mode-line-inactive nil :family "Liberation Mono" :height 110)
#+end_SRC
*** All the Icons
#+begin_SRC emacs-lisp :tangle init.el
(require 'all-the-icons)
#+end_SRC
** Doom Themes
#+begin_SRC emacs-lisp :tangle no
(use-package doom-themes
             :config
             ;; Global settings (defaults)
             (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
                   doom-themes-enable-italic t) ; if nil, italics is universally disabled
             (load-theme 'doom-tomorrow-night t)

             ;; Enable flashing mode-line on errors
             (doom-themes-visual-bell-config)

             ;; Corrects (and improves) org-mode's native fontification.
             (doom-themes-org-config))
#+end_SRC
* Package Configuration
