.emacs.d/init.org
** Evil
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'evil)
(evil-mode 1)
(setq evil-want-Y-yank-to-eol nil)
#+END_SRC

Set the cursor color based on evil state:

#+begin_SRC emacs-lisp :tangle init.el
(defvar my/base16-colors base16-default-dark-colors)
(setq evil-emacs-state-cursor   `(,(plist-get my/base16-colors :base0D) box))
(setq evil-insert-state-cursor  `(,(plist-get my/base16-colors :base0D) box))
(setq evil-motion-state-cursor  `(,(plist-get my/base16-colors :base0E) box))
(setq evil-normal-state-cursor  `(,(plist-get my/base16-colors :base0B) box))
(setq evil-replace-state-cursor `(,(plist-get my/base16-colors :base08) box))
(setq evil-visual-state-cursor  `(,(plist-get my/base16-colors :base09) box))
#+end_SRC

** Which-key
Check   the  [[https://github.com/justbur/emacs-which-key][documentation]]   for
further configuration.
#+begin_SRC emacs-lisp :tangle init.el
(require 'which-key)
(which-key-mode)
#+end_SRC
** Ein (Emacs IPython Notebook)                                   :noexport:
#+begin_SRC emacs-lisp
(require 'ein)
(require 'ein-notebook)
#+end_SRC
*** Support for IJulia, ESS...
#+begin_SRC emacs-lisp
(setq ein:polymode t)
#+end_SRC

** Org mode
Load package:
#+begin_src emacs-lisp :tangle init.el
(require 'org)
#+end_SRC

*** Paths
Always include relative paths in file links:

#+begin_SRC emacs-lisp :tangle init.el
(setq org-link-file-path-type 'relative)
#+end_SRC
*** Inline Images
Don't show inline images, re-show images after running code:
#+begin_SRC emacs-lisp :tangle init.el
(add-hook 'org-mode-hook 'org-display-inline-images)
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
(setq org-startup-with-inline-images nil)
;; (setq org-image-actual-width nil)
#+end_SRC

*** Visual
Hide formatting marks (*,=,/,...):
#+begin_SRC emacs-lisp :tangle init.el
;; (setq org-hide-emphasis-markers t)
(setq org-hide-emphasis-markers nil)
#+end_SRC

Don't hide link markers ("[", "]"):
#+begin_SRC emacs-lisp :tangle init.el
(setq org-descriptive-links nil)
#+end_SRC

Show parsed "latex" symbols, such as "\ theta" (\theta):
#+begin_SRC emacs-lisp :tangle init.el
;; (setq org-pretty-entities t)
(setq org-pretty-entities nil)
#+end_SRC

HTML exports use css:
#+begin_SRC emacs-lisp :tangle init.el
(setq org-html-htmlize-output-type (quote css))
#+end_SRC

Control separator lines between subtrees:
#+begin_SRC emacs-lisp :tangle init.el
(setq org-cycle-separator-lines 0)
#+end_SRC

