.emacs.d/init.el
(setq evil-want-Y-yank-to-eol nil)

(defvar my/base16-colors base16-default-dark-colors)
(setq evil-emacs-state-cursor   `(,(plist-get my/base16-colors :base0D) box))
(setq evil-insert-state-cursor  `(,(plist-get my/base16-colors :base0D) box))
(setq evil-motion-state-cursor  `(,(plist-get my/base16-colors :base0E) box))
(setq evil-normal-state-cursor  `(,(plist-get my/base16-colors :base0B) box))
(setq evil-replace-state-cursor `(,(plist-get my/base16-colors :base08) box))
(setq evil-visual-state-cursor  `(,(plist-get my/base16-colors :base09) box))

(require 'which-key)
(which-key-mode)

(require 'org)

(setq org-link-file-path-type 'relative)

(add-hook 'org-mode-hook 'org-display-inline-images)
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
(setq org-startup-with-inline-images nil)
;; (setq org-image-actual-width nil)

;; (setq org-hide-emphasis-markers t)
(setq org-hide-emphasis-markers nil)

(setq org-descriptive-links nil)

;; (setq org-pretty-entities t)
(setq org-pretty-entities nil)

(setq org-html-htmlize-output-type (quote css))

(setq org-cycle-separator-lines 0)
