.emacs.d/init.el

(setq org-directory "~/org")
(setq org-default-notes-file (concat org-directory "/notes.org"))

(global-set-key (kbd "C-c c") 'org-capture)

(setq org-capture-templates
      `(
        ("p" "Personal task")
        ("pp" "No deadline, no reminder" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Personal")
         ,(concat "* TODO %? :personal:"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :tree-type day :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("pd" "With a deadline" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Personal")
         ,(concat "* TODO %? :personal:"
                  "\nDEADLINE: %^{Task deadline}t"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :tree-type day :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("pt" "No deadline, with reminder" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Personal")
         ,(concat "* TODO %? :personal:"
                  "\n%^{Remind me on}t"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :tree-type day :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("w" "Work task")
        ("ww" "No deadline, no reminder" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Work")
         ,(concat "* TODO %? :work:"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :tree-type day :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("wd" "With a deadline" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Work")
         ,(concat "* TODO %? :work:"
                  "\nDEADLINE: %^{Task deadline}t"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :tree-type day :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("wt" "No deadline, with reminder" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Work")
         ,(concat "* TODO %? :work:"
                  "\n%^{Remind me on}t"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :tree-type day :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("e" "Enough item" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Enough")
         ,(concat "* TODO %? :enough:"
                  "\nSCHEDULED: %^{Schedule task to}t"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :tree-type day :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("j" "Journal entry")
        ("jj" "General journal entry" entry
         (file+olp+datetree ,(concat org-directory "/journal/journal.org"))
         ,(concat "* %? %^G"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :jump-to-captured t :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("jl" "Lux linux journal entry" entry
         (file+olp+datetree ,(concat org-directory "/luxlinux/journal.org") "Journal")
         ,(concat "* %? %^G"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :jump-to-captured t :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("m" "Meeting")
        ("mm" "Record notes (general)" entry
         (file+olp+datetree ,(concat org-directory "/journal/journal.org"))
         ,(concat "* %? %^G:meeting:"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :jump-to-captured t :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("ma" "Make an appointment" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Meetings")
         ,(concat "* TODO %? %^G:meeting:"
                  "\n%^{Schedule meeting to}t"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("ml" "Record Lux notes" entry
         (file+olp+datetree ,(concat org-directory "/luxlinux/journal.org") "Meetings")
         ,(concat "* %? %^G:meeting:"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :jump-to-captured t :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("t" "Teaching")
        ("ta" "Make an appointment" entry
         (file+olp+datetree ,(concat org-directory "/tasks/tasks.org") "Teaching")
         ,(concat "* TODO %? %^G:teaching:"
                  "\n%^{Schedule class to}t"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("tn" "Record notes" entry
         (file+olp+datetree ,(concat org-directory "/journal/journal.org"))
         ,(concat "* %? %^G:teaching:"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n%i\n")
         :jump-to-captured t :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("b" "Bibliographic entry")
        ("bb" "Reference" entry
         (file+olp+datetree ,(concat org-directory "/bibliography/bibliography.org")
                            "References")
         ,(concat "* %? %^G:bib:"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n\n"
                  "** Notes\n\n"
                  "** Bibtex\n\n"
                  "#+begin_src bibtex :tangle \"references.bib\"\n"
                  "@article{}\n"
                  "#+end_src\n%i\n")
         :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ("br" "Reading list" entry
         (file+olp+datetree ,(concat org-directory "/bibliography/bibliography.org")
                                     "References")
         ,(concat "* TODO %? %^G:bib:"
                  "\n:PROPERTIES:"
                  "\n:CAPTURED: %U"
                  "\n:END:\n\n"
                  "** Notes\n\n"
                  "** Bibtex\n\n"
                  "#+begin_src bibtex :tangle \"references.bib\"\n"
                  "@article{}\n"
                  "#+end_src\n%i\n")
         :jump-to-captured nil :empty-lines-after 1
         :empty-lines-before 0 :unnarrowed nil)
        ))

(setq org-agenda-files (list "/home/phrb/org/tasks"
                             "/home/phrb/org/journal"
                             "/home/phrb/org/bibliography"))

(setq org-agenda-restore-windows-after-quit t)

(global-set-key (kbd "C-c a") 'org-agenda)
