.emacs.d/init.org
**** Custom Commands
#+begin_SRC emacs-lisp :tangle init.el
(setq org-agenda-custom-commands
      '(("w" "Agenda and work tasks"
         ((agenda "")
          (tags-todo "work")))
        ("b" "Agenda, work, and bib tasks"
         ((agenda "")
          (tags-todo "work")
          (tags-todo "bib")
          (tags-todo "reading")))
        ("p" "Agenda and personal tasks"
         ((agenda "")
          (tags-todo "personal")))))
#+end_SRC
*** Latex Exporting (ox-latex)
**** Remove hyperref section
#+begin_SRC emacs-lisp :tangle init.el
(setq org-latex-with-hyperref nil)
#+end_SRC
**** Custom Classes
#+begin_SRC emacs-lisp :tangle init.el
(require 'ox-latex)

;; Change for beamer
;;(setq org-latex-pdf-process (list "latexmk -xelatex %f"))

;; (setq org-latex-pdf-process (list "latexmk -pdflatex='pdflatex' -pdf -f %f"))
(setq org-latex-pdf-process (list "latexmk -pdflatex='pdflatex -interaction nonstopmode -output-directory %o %f' -pdf -f %f -output-directory=%o"))
(setq org-latex-default-packages-alist nil)
(setq org-latex-packages-alist (quote (("" "booktabs" t))))

(setq org-latex-listings t)
(add-to-list 'org-latex-classes
             '("org-elsarticle"
               "\\documentclass{elsarticle}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
             '("org-ieeetran"
               "\\documentclass{IEEEtran}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
           '("partless-book"
              "\\documentclass{book}"
              ("\\chapter{%s}" . "\\chapter{%s}")
              ("\\section{%s}" . "\\section*{%s}")
              ("\\subsection{%s}" . "\\subsection*{%s}")
              ("\\paragraph{%s}" . "\\paragraph*{%s}")
              )
)
#+end_src
**** Prefer User Header
#+begin_SRC emacs-lisp :tangle init.el
(setq org-latex-prefer-user-labels t)
#+end_SRC
**** Use Minted for Source Blocks
#+begin_SRC emacs-lisp :tangle init.el
(setq org-latex-listings 'minted)
#+end_SRC
*** Markdown Exporting (ox-md)
#+begin_SRC emacs-lisp :tangle init.el
(require 'ox-md)
#+end_SRC
*** ODT Exporting (ox-odt)
#+begin_SRC emacs-lisp :tangle init.el
(require 'ox-odt)
#+end_SRC
*** Source Blocks and Templates (org-tempo)
#+begin_SRC emacs-lisp :tangle init.el
(setq org-edit-src-auto-save-idle-delay 5)
(setq org-edit-src-content-indentation 0)
(setq org-src-fontify-natively t)
(setq org-src-window-setup (quote other-window))
(setq org-confirm-babel-evaluate nil)
#+end_SRC

**** Source Block Templates (org-tempo)
#+begin_src emacs-lisp :tangle init.el
(require 'org-tempo)

(setq org-babel-default-header-args
      '((:session . "none")
	(:results . "output replace")
	(:exports . "results")
	(:cache . "no")
	(:noweb . "yes")
	(:hlines . "no")
	(:tangle . "no")
        (:eval . "no-export")
	(:padnewline . "yes")))

(setq org-babel-default-header-args:R
      '((:session . "*R*")))

(setq org-babel-default-header-args:bash
      '((:session . "*Shell*")))

(setq org-babel-default-header-args:python
      '((:session . "*Python*")))

(add-to-list 'org-structure-template-alist
             '("eI" . "SRC emacs-lisp :tangle init.el"))
(add-to-list 'org-structure-template-alist
             '("Sh" . "SRC shell"))
(add-to-list 'org-structure-template-alist
             '("Sb" . "SRC bash"))
(add-to-list 'org-structure-template-alist
             '("b" . "SRC bibtex :tangle ./bib/references.bib"))
(add-to-list 'org-structure-template-alist
             '("j" . "SRC julia"))
(add-to-list 'org-structure-template-alist
             '("p" . "SRC python"))
(add-to-list 'org-structure-template-alist
             '("r" . "SRC R"))
(add-to-list 'org-structure-template-alist
             '("g" . "SRC R :results file graphics output :file \".pdf\" :width 10 :height 10 :eval no-export"))
(add-to-list 'org-structure-template-alist
             '("t" . "SRC latex :results output latex"))
#+end_src

*** Pretty Bullets (org-bullets)
Was causing problems when loading large buffers, so I removed it.

#+begin_src emacs-lisp :tangle init.el
; (require 'org-bullets)
; (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
;
; (setq org-bullets-bullet-list '("☯" "☢" "✜" "✚" "♠" "♣" "❀"))
#+end_src
*** Emacs Jupyter (ob-jupyter)
#+begin_SRC emacs-lisp :tangle no
(setq org-babel-default-header-args:jupyter-julia '((:async . "yes")
                                                    (:session . "Julia")
                                                    (:kernel . "julia-1.5")))

(setq ob-async-no-async-languages-alist '("jupyter-python" "jupyter-julia"))
#+end_SRC

#+RESULTS:
| jupyter-python | jupyter-julia |

*** Babel Languages (org-babel)
Setting Julia program:
#+begin_SRC emacs-lisp :tangle no
(setq inferior-julia-program-name "/usr/bin/julia")
#+end_SRC

Remove python completion:
#+begin_SRC emacs-lisp :tangle init.el
(setq python-shell-completion-native-enable nil)
#+end_SRC

Loading the following babel languages:
#+begin_SRC emacs-lisp :tangle init.el
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (R . t)
   (C . t)
   (julia . t)
   (python . t)
   (emacs-lisp . t)
   (shell . t)
   (ruby . t)
   (org . t)
   (makefile . t)
   (latex . t)
   (jupyter . t)
   ))
#+end_SRC

**** Overriding Julia Block
#+begin_SRC emacs-lisp :tangle no
(org-babel-jupyter-override-src-block "julia")
#+end_SRC
*** Expanding Linked Attachment Images (org-attach)
#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'org-attach)
(setq org-link-abbrev-alist '(("att" . org-attach-expand-link)))
#+END_SRC
*** Exporting to Jekyll (local org2jekyll)
Using a local org2jekyll install for now, with this configuration:
#+begin_SRC emacs-lisp :tangle init.el
(require 'org2jekyll)

(setq org2jekyll-blog-author       "phrb")
(setq org2jekyll-source-directory  (expand-file-name "~/code/phrb.github.io/org"))
(setq org2jekyll-jekyll-directory  (expand-file-name "~/code/phrb.github.io"))
(setq org2jekyll-jekyll-drafts-dir "")
(setq org2jekyll-jekyll-posts-dir  "_posts/")
(setq org-publish-project-alist
      `(("page"
         :base-directory ,(org2jekyll-input-directory)
         :base-extension "org"
         ;; :publishing-directory "/ssh:user@host:~/html/notebook/"
         :publishing-directory ,(org2jekyll-output-directory)
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :section-numbers nil
         :with-toc nil
         :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
         :html-preamble t
         :recursive t
         :make-index t
         :html-extension "html"
         :body-only t)

        ("post"
         :base-directory ,(org2jekyll-input-directory)
         :base-extension "org"
         :publishing-directory ,(org2jekyll-output-directory org2jekyll-jekyll-posts-dir)
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :section-numbers nil
         :with-toc nil
         :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
         :html-preamble t
         :recursive t
         :make-index t
         :html-extension "html"
         :body-only t)

        ("images"
         :base-directory ,(org2jekyll-input-directory "img")
         :base-extension "jpg\\|gif\\|png"
         :publishing-directory ,(org2jekyll-output-directory "img")
         :publishing-function org-publish-attachment
         :recursive t)

        ("js"
         :base-directory ,(org2jekyll-input-directory "js")
         :base-extension "js"
         :publishing-directory ,(org2jekyll-output-directory "js")
         :publishing-function org-publish-attachment
         :recursive t)

        ("css"
         :base-directory ,(org2jekyll-input-directory "css")
         :base-extension "css\\|el"
         :publishing-directory ,(org2jekyll-output-directory "css")
         :publishing-function org-publish-attachment
         :recursive t)

        ("web" :components ("images" "js" "css"))
        )
      )
#+end_SRC
*** Adding the ignore tag
#+begin_SRC emacs-lisp :tangle init.el
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))
#+end_SRC
** ESS (Emacs Speaks Statistics)
Set R indentation level:
#+begin_SRC emacs-lisp :tangle init.el
(setq ess-indent-level 4)
#+end_SRC
** Ivy
Loading package:
#+begin_SRC emacs-lisp :tangle init.el
(require 'ivy)
(ivy-mode 1)
#+end_SRC

Defaults:
#+begin_SRC emacs-lisp :tangle init.el
(setq ivy-use-virtual-buffers t)
(setq ivy-count-format "(%d/%d) ")

(global-set-key (kbd "C-s") 'swiper)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
#+end_SRC
