.emacs.d/init.el

(setq org-agenda-custom-commands
      '(("w" "Agenda and work tasks"
         ((agenda "")
          (tags-todo "work")))
        ("b" "Agenda, work, and bib tasks"
         ((agenda "")
          (tags-todo "work")
          (tags-todo "bib")
          (tags-todo "reading")))
        ("p" "Agenda and personal tasks"
         ((agenda "")
          (tags-todo "personal")))))

(setq org-latex-with-hyperref nil)

(require 'ox-latex)

;; Change for beamer
;;(setq org-latex-pdf-process (list "latexmk -xelatex %f"))

;; (setq org-latex-pdf-process (list "latexmk -pdflatex='pdflatex' -pdf -f %f"))
(setq org-latex-pdf-process (list "latexmk -pdflatex='pdflatex -interaction nonstopmode -output-directory %o %f' -pdf -f %f -output-directory=%o"))
(setq org-latex-default-packages-alist nil)
(setq org-latex-packages-alist (quote (("" "booktabs" t))))

(setq org-latex-listings t)
(add-to-list 'org-latex-classes
             '("org-elsarticle"
               "\\documentclass{elsarticle}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
             '("org-ieeetran"
               "\\documentclass{IEEEtran}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
           '("partless-book"
              "\\documentclass{book}"
              ("\\chapter{%s}" . "\\chapter{%s}")
              ("\\section{%s}" . "\\section*{%s}")
              ("\\subsection{%s}" . "\\subsection*{%s}")
              ("\\paragraph{%s}" . "\\paragraph*{%s}")
              )
)

(setq org-latex-prefer-user-labels t)

(setq org-latex-listings 'minted)

(require 'ox-md)

(require 'ox-odt)

(setq org-edit-src-auto-save-idle-delay 5)
(setq org-edit-src-content-indentation 0)
(setq org-src-fontify-natively t)
(setq org-src-window-setup (quote other-window))
(setq org-confirm-babel-evaluate nil)

(require 'org-tempo)

(setq org-babel-default-header-args
      '((:session . "none")
	(:results . "output replace")
	(:exports . "results")
	(:cache . "no")
	(:noweb . "yes")
	(:hlines . "no")
	(:tangle . "no")
        (:eval . "no-export")
	(:padnewline . "yes")))

(setq org-babel-default-header-args:R
      '((:session . "*R*")))

(setq org-babel-default-header-args:bash
      '((:session . "*Shell*")))

(setq org-babel-default-header-args:python
      '((:session . "*Python*")))

(add-to-list 'org-structure-template-alist
             '("eI" . "SRC emacs-lisp :tangle init.el"))
(add-to-list 'org-structure-template-alist
             '("Sh" . "SRC shell"))
(add-to-list 'org-structure-template-alist
             '("Sb" . "SRC bash"))
(add-to-list 'org-structure-template-alist
             '("b" . "SRC bibtex :tangle ./bib/references.bib"))
(add-to-list 'org-structure-template-alist
             '("j" . "SRC julia"))
(add-to-list 'org-structure-template-alist
             '("p" . "SRC python"))
(add-to-list 'org-structure-template-alist
             '("r" . "SRC R"))
(add-to-list 'org-structure-template-alist
             '("g" . "SRC R :results file graphics output :file \".pdf\" :width 10 :height 10 :eval no-export"))
(add-to-list 'org-structure-template-alist
             '("t" . "SRC latex :results output latex"))

; (require 'org-bullets)
; (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
;
; (setq org-bullets-bullet-list '("☯" "☢" "✜" "✚" "♠" "♣" "❀"))

(setq python-shell-completion-native-enable nil)

(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (R . t)
   (C . t)
   (julia . t)
   (python . t)
   (emacs-lisp . t)
   (shell . t)
   (ruby . t)
   (org . t)
   (makefile . t)
   (latex . t)
   (jupyter . t)
   ))

(require 'org-attach)
(setq org-link-abbrev-alist '(("att" . org-attach-expand-link)))

(require 'org2jekyll)

(setq org2jekyll-blog-author       "phrb")
(setq org2jekyll-source-directory  (expand-file-name "~/code/phrb.github.io/org"))
(setq org2jekyll-jekyll-directory  (expand-file-name "~/code/phrb.github.io"))
(setq org2jekyll-jekyll-drafts-dir "")
(setq org2jekyll-jekyll-posts-dir  "_posts/")
(setq org-publish-project-alist
      `(("page"
         :base-directory ,(org2jekyll-input-directory)
         :base-extension "org"
         ;; :publishing-directory "/ssh:user@host:~/html/notebook/"
         :publishing-directory ,(org2jekyll-output-directory)
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :section-numbers nil
         :with-toc nil
         :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
         :html-preamble t
         :recursive t
         :make-index t
         :html-extension "html"
         :body-only t)

        ("post"
         :base-directory ,(org2jekyll-input-directory)
         :base-extension "org"
         :publishing-directory ,(org2jekyll-output-directory org2jekyll-jekyll-posts-dir)
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :section-numbers nil
         :with-toc nil
         :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
         :html-preamble t
         :recursive t
         :make-index t
         :html-extension "html"
         :body-only t)

        ("images"
         :base-directory ,(org2jekyll-input-directory "img")
         :base-extension "jpg\\|gif\\|png"
         :publishing-directory ,(org2jekyll-output-directory "img")
         :publishing-function org-publish-attachment
         :recursive t)

        ("js"
         :base-directory ,(org2jekyll-input-directory "js")
         :base-extension "js"
         :publishing-directory ,(org2jekyll-output-directory "js")
         :publishing-function org-publish-attachment
         :recursive t)

        ("css"
         :base-directory ,(org2jekyll-input-directory "css")
         :base-extension "css\\|el"
         :publishing-directory ,(org2jekyll-output-directory "css")
         :publishing-function org-publish-attachment
         :recursive t)

        ("web" :components ("images" "js" "css"))
        )
      )

(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))

(setq ess-indent-level 4)

(require 'ivy)
(ivy-mode 1)

(setq ivy-use-virtual-buffers t)
(setq ivy-count-format "(%d/%d) ")

(global-set-key (kbd "C-s") 'swiper)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)

(require 'magit)
