.emacs.d/init.org
** Magit
#+begin_SRC emacs-lisp :tangle init.el
(require 'magit)
(define-key global-map (kbd "C-c g") 'magit-status)
#+end_SRC
** Ebib
#+begin_SRC emacs-lisp :tangle init.el
(require 'ebib)

(global-set-key (kbd "C-c e") 'ebib)

(setq ebib-preload-bib-files '("~/cloud/papers/bibliography/references.bib"
                               "~/org/journal/bib/references.bib"))

(setq ebib-bibtex-dialect 'biblatex)
#+end_SRC
