.emacs.d/init.el
(define-key global-map (kbd "C-c g") 'magit-status)

(require 'ebib)

(global-set-key (kbd "C-c e") 'ebib)

(setq ebib-preload-bib-files '("~/cloud/papers/bibliography/references.bib"
                               "~/org/journal/bib/references.bib"))

(setq ebib-bibtex-dialect 'biblatex)
